app/views/posts/_like_button.html.erb

      <%= button_to post_like_path(@post), method: :delete, class: "text-red-500" do %>
        <i class="fas fa-heart"></i> <%= @post.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]

      <%= button_to post_like_path(@post), method: :post, class: "text-gray-500 hover:text-red-500" do %>
        <i class="far fa-heart"></i> <%= @post.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]