app/views/posts/edit.html.erb

            <div class="text-right text-xs text-gray-500 mt-1">
              <span data-character-counter-target="counter"><%= @post.daily_question&.body ? @post.daily_question.body.length : 0 %></span>/400字
---
SELECT "daily_questions".* FROM "daily_questions" WHERE "daily_questions"."post_id" = $1 LIMIT $2  [["post_id", 4], ["LIMIT", 1]]