app/controllers/daily_questions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT "daily_questions".* FROM "daily_questions" WHERE "daily_questions"."post_id" IN ($1, $2)  [["post_id", 7], ["post_id", 8]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 2]]
---
  def index
    @daily_questions = current_user.posts.includes(:daily_question, :user).map(&:daily_question).compact

SELECT "daily_questions".* FROM "daily_questions" WHERE "daily_questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def show
    @daily_question = DailyQuestion.includes(post: :user).find(params[:id])