app/controllers/posts_controller.rb

    def index
        @posts = Post.includes(:user)
---
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]

    def create
        @post = current_user.posts.build(post_params)
        if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "learning_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "あああ"], ["body", "っっだ"], ["user_id", 1], ["learning_date", "2025-03-21"], ["created_at", "2025-03-21 08:05:56.654628"], ["updated_at", "2025-03-21 08:05:56.654628"]]

    def update
        @post = Post.find(params[:id])
        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "WWWWW"], ["updated_at", "2025-03-21 12:24:20.060394"], ["id", 4]]