app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1  [["id", 15]]
---
  def set_post
    @post = Post.find(params[:id])