app/controllers/profiles_controller.rb

  def show
    @user = params[:id] ? @user : current_user
    @posts = @user.posts.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]

  def update
    @user = current_user
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "bio" = $2 WHERE "users"."id" = $3  [["updated_at", "2025-03-22 13:39:15.762397"], ["bio", "よろしくね！\n"], ["id", 1]]

  def set_user
    @user = User.find(params[:id]) if params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]