app/models/user.rb

  def like(post)
    liked_posts << post unless like?(post)
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["post_id", 1], ["created_at", "2025-04-06 00:31:31.430235"], ["updated_at", "2025-04-06 00:31:31.430235"]]

  def unlike(post)
    liked_posts.delete(post)
---
DELETE FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2  [["user_id", 2], ["post_id", 1]]